In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [79]:
data = pd.read_csv("data/BA_reviews.csv")

In [80]:
data.head(4)

   Unnamed: 0                                            reviews
0           0  Not Verified |  Happy with the flight crew. Ha...
1           1  ✅ Trip Verified |   Horrible service from boar...
2           2  Not Verified |  My wife and I are very disappo...
3           3  Not Verified |  We flew BA between Heathrow an...

In [81]:
data.drop(columns='Unnamed: 0', inplace=True)

In [82]:
data

                                                reviews
0     Not Verified |  Happy with the flight crew. Ha...
1     ✅ Trip Verified |   Horrible service from boar...
2     Not Verified |  My wife and I are very disappo...
3     Not Verified |  We flew BA between Heathrow an...
4     Not Verified |  Absolutely disgusted with BA. ...
...                                                 ...
1995  ✅ Verified Review |  Los Angeles to London Hea...
1996  ✅ Verified Review |  Gatwick to Barcelona. Uni...
1997  ✅ Verified Review |  London Heathrow to Rio de...
1998  ❎ Unverified |  London Heathrow to New York. P...
1999  ❎ Unverified |  Flew British Airways economy f...

[2000 rows x 1 columns]

In [83]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 1 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   reviews  2000 non-null   object
dtypes: object(1)
memory usage: 15.8+ KB

In [37]:
data.drop_duplicates(inplace=True)

In [38]:
data.duplicated().sum()

0

In [85]:
data.reviews.str.split("|", expand=True).get(1)

0         Happy with the flight crew. Hadn't been on a...
1          Horrible service from boarding to landing. ...
2         My wife and I are very disappointed with fly...
3         We flew BA between Heathrow and Berlin one w...
4         Absolutely disgusted with BA. Our flights we...
                              ...
1995      Los Angeles to London Heathrow. Starting wit...
1996      Gatwick to Barcelona. Unimpressed with the n...
1997      London Heathrow to Rio de Janeiro. 45 minute...
1998      London Heathrow to New York. Paid £250 to pr...
1999      Flew British Airways economy from Tampa to A...
Name: 1, Length: 2000, dtype: object

In [86]:
# collect all review data into a list

data.reviews = data.reviews.str.split("|", expand=True).get(1)

In [91]:
data.head()

                                             reviews
0    Happy with the flight crew. Hadn't been on a...
1     Horrible service from boarding to landing. ...
2    My wife and I are very disappointed with fly...
3    We flew BA between Heathrow and Berlin one w...
4    Absolutely disgusted with BA. Our flights we...